erp3l/src/Catalogs/ВидыОбъектовФинансовогоХарактера/ВидыОбъектовФинансовогоХарактера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОбъектовФинансовогоХарактера</name>
  <predefined>
    <items>
      <name>ВексельВыданный</name>
      <description>Вексель выданный</description>
    </items>
    <items>
      <name>ВексельПолученный</name>
      <description>Вексель полученный</description>
    </items>
    <items>
      <name>ДебиторскаяЗадолженность</name>
      <description>Дебиторская задолженность</description>
    </items>
    <items>
      <name>ДепозитВыданный</name>
      <description>Депозит выданный</description>
    </items>
    <items>
      <name>ЗаемВыданный</name>
      <description>Заем выданный</description>
    </items>
    <items>
      <name>ЗаемПолученный</name>
      <description>Заем полученный</description>
    </items>
    <items>
      <name>КредитПолученный</name>
      <description>Кредит полученный</description>
    </items>
    <items>
      <name>ЛизингВыданный</name>
      <description>Лизинг выданный</description>
    </items>
    <items>
      <name>ОбязательствоПоФинансовомуЛизингу</name>
      <description>Обязательство по финансовому лизингу</description>
    </items>
    <items>
      <name>ПроизводныйФинансовыйИнструмент</name>
      <description>Производный финансовый инструмент</description>
    </items>
    <items>
      <name>ЦеннаяБумагаПУ</name>
      <description>Ценная бумага (по справедливой стоимости через прибыль/убыток)</description>
    </items>
    <items>
      <name>ЦеннаяБумагаСД</name>
      <description>Ценная бумага (по справедливой стоимости через прочий совокупный доход)</description>
    </items>
  </predefined>
  <attributes>
    <name>СпособУчета</name>
    <type>
      <types>EnumRef.СпособыУчетаФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>АктивОбязательство</name>
    <type>
      <types>EnumRef.АктивОбязательствоОбъектовФинансовогоХарактера</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтавкиРасчетаПроцентов</name>
    <type>
      <types>EnumRef.ВидыСтавокОбъектовФинансовогоХарактера</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрименятьПоправкуПоСправедливойСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнаниеПроцентовМСФО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереводВКраткосрочную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеклассДляОтчетности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лизинг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСрокиЗадолженности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводныйФИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособУчетаПереоценки</name>
    <type>
      <types>EnumRef.СпособыУчетаПереоценкиФИ</types>
    </type>
  </attributes>
  <attributes>
    <name>РаскрытиеСправедливойСтоимости</name>
    <type>
      <types>EnumRef.ВидыРаскрытияСправедливойСтоимостиФИ</types>
    </type>
  </attributes>
  <attributes>
    <name>Задолженность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратПоГрафику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокУчетаДисконта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикиРасчетовСоответствуютНСБУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/Catalogs/ВидыОбъектовФинансовогоХарактера/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Предопределенный Тогда
		
		ТолькоПросмотр = Истина;
		Элементы.ТипФИ.ТолькоПросмотр = Истина;
		Элементы.Задолженность.ТолькоПросмотр = Истина;
		Элементы.ВозвратПоГрафику.ТолькоПросмотр = Истина;
		Элементы.ПереводЗадолженностиИзДолгосрочной.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	Если Не ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом() Тогда //в БМ ДКЗ и МКЗ не доступны
		Элементы.Задолженность.Видимость = Ложь;
		Если Объект.Задолженность Тогда
			Объект.Задолженность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ТипФИ 								= (Объект.Лизинг = Истина);
	ПереводЗадолженностиИзДолгосрочной 	= Объект.ПереводВКраткосрочную;
	ВозвратПоГрафику 					= Объект.ВозвратПоГрафику;
	Задолженность 						= Объект.Задолженность;
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура АктивОбязательствоПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СпособУчетаПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизводныйФИПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТипФИПриИзменении(Элемент)
	
	Объект.Лизинг = (ТипФИ = 1);
	УправлениеФормой(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПереводЗадолженностиИзДолгосрочнойПриИзменении(Элемент)
		
	Объект.ПереводВКраткосрочную = (ПереводЗадолженностиИзДолгосрочной = 1);
	УправлениеФормой(ЭтаФорма);	

КонецПроцедуры

&НаКлиенте
Процедура ВозвратПоГрафикуПриИзменении(Элемент)
	
	Объект.ВозвратПоГрафику = (ВозвратПоГрафику = 1);
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ВидСтавкиРасчетаПроцентовПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗадолженностьПриИзменении(Элемент)
	Объект.Задолженность = (Задолженность = 1);	
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ГрафикиРасчетовСоответствуютНСБУПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если Объект.СпособУчета = ПредопределенноеЗначение("Перечисление.СпособыУчетаФинансовыхИнструментов.ПоСправедливойСтоимости") Тогда
		
		Элементы.СтраницыСпособУчета.ТекущаяСтраница = Элементы.ГруппаСправедливаяСтоимость;
				
		Элементы.СпособУчетаПереоценки.ТолькоПросмотр = Объект.ПроизводныйФИ;
		Если Объект.ПроизводныйФИ Тогда
			ЧерезПрибыльУбыток = ПредопределенноеЗначение("Перечисление.СпособыУчетаПереоценкиФИ.ЧерезПрибыльУбыток");
			ОбщегоНазначенияУХ.УстановитьНовоеЗначение(Объект.СпособУчетаПереоценки, ЧерезПрибыльУбыток);		
		КонецЕсли;
		
		Элементы.АктивОбязательствоПФИ.ТолькоПросмотр = Объект.ПроизводныйФИ;
		Если Объект.ПроизводныйФИ Тогда
			Объект.АктивОбязательство = ПредопределенноеЗначение("Перечисление.АктивОбязательствоОбъектовФинансовогоХарактера.ПустаяСсылка");
		КонецЕсли;
		
	Иначе
		
		Элементы.АктивОбязательствоПФИ.ТолькоПросмотр = Ложь;
		
		ЭтоАктив = Объект.АктивОбязательство = ПредопределенноеЗначение("Перечисление.АктивОбязательствоОбъектовФинансовогоХарактера.Актив");
		ПредставлениеДКЗ = ?(ЭтоАктив, НСтр("ru = 'Торговый инcтрумент (дебиторская задолженность)'"), НСтр("ru = 'Торговый инструмент (кредиторская задолженность)'"));
		Элементы.Задолженность.СписокВыбора[1].Представление = ПредставлениеДКЗ;
		
		Элементы.СтраницыСпособУчета.ТекущаяСтраница = Элементы.ГруппаАмортизированнаяСтоимость;
		
		ВидыСтавок = ПолучитьВидыСтавок(Объект.Лизинг, Объект.Задолженность);
		СписокВыбораСтавка = Элементы.ВидСтавкиРасчетаПроцентов.СписокВыбора;		
		СписокВыбораСтавка.Очистить();
		Для каждого ВидСтавки Из ВидыСтавок Цикл
			СписокВыбораСтавка.Добавить(ВидСтавки.Значение, ВидСтавки.Представление);
		КонецЦикла;
		
		ВидЭСП = ПредопределенноеЗначение("Перечисление.ВидыСтавокОбъектовФинансовогоХарактера.ЭффективнаяСтавка");
		
		Если Объект.Лизинг Тогда
			
			Объект.ГрафикиРасчетовСоответствуютНСБУ = Ложь;
			Элементы.ГрафикиРасчетовСоответствуютНСБУ.ТолькоПросмотр = Истина;
			
			Форма.ВозвратПоГрафику = 0;
			Объект.ВозвратПоГрафику = Ложь;
			
		ИначеЕсли Объект.Задолженность Тогда
			
			Форма.ВозвратПоГрафику = 1;
			Объект.ВозвратПоГрафику = Истина;
			Объект.ПорядокУчетаДисконта = Истина;
			
		КонецЕсли;
				
		Элементы.ПорядокУчетаДисконта.ТолькоПросмотр 		= Объект.Задолженность Или (Объект.ВидСтавкиРасчетаПроцентов = ВидЭСП);		
		Элементы.ВидСтавкиРасчетаПроцентов.ТолькоПросмотр 	= Объект.ГрафикиРасчетовСоответствуютНСБУ;
		Элементы.ВозвратПоГрафику.ТолькоПросмотр 			= Объект.ГрафикиРасчетовСоответствуютНСБУ Или Объект.Лизинг Или Объект.Задолженность;
		
		Если Объект.ГрафикиРасчетовСоответствуютНСБУ Тогда		
			Объект.ВидСтавкиРасчетаПроцентов = ПредопределенноеЗначение("Перечисление.ВидыСтавокОбъектовФинансовогоХарактера.СтавкаПоДоговору");
			Объект.ВозвратПоГрафику = Истина;
			Форма.ВозвратПоГрафику = Объект.ВозвратПоГрафику;
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидыСтавок(Лизинг = Ложь, Задолженность = Ложь)

	ВидыСтавок = Новый СписокЗначений;
	
	Если Лизинг Тогда
		
		ВидыСтавок.Добавить(Перечисления.ВидыСтавокОбъектовФинансовогоХарактера.ЭффективнаяСтавка, НСтр("ru = 'Подразумеваемая ставка'"));		
		ВидыСтавок.Добавить(Перечисления.ВидыСтавокОбъектовФинансовогоХарактера.СтавкаПоДоговору, НСтр("ru = 'Ставка по договору'"));
		ВидыСтавок.Добавить(Перечисления.ВидыСтавокОбъектовФинансовогоХарактера.РыночнаяСтавка, НСтр("ru = 'Вмененная ставка'"));
		
	Иначе
		
		Если Не Задолженность Тогда
			ВидыСтавок.Добавить(Перечисления.ВидыСтавокОбъектовФинансовогоХарактера.ЭффективнаяСтавка, НСтр("ru = 'Эффективная ставка'"));
		КонецЕсли;		
		ВидыСтавок.Добавить(Перечисления.ВидыСтавокОбъектовФинансовогоХарактера.СтавкаПоДоговору, НСтр("ru = 'Ставка по договору'"));
		ВидыСтавок.Добавить(Перечисления.ВидыСтавокОбъектовФинансовогоХарактера.РыночнаяСтавка, НСтр("ru = 'Рыночная ставка'"));
	
	КонецЕсли;

	Возврат ВидыСтавок;
	
КонецФункции

#КонецОбласти
